tap 'homebrew/cask'

### Terminal Basics
brew 'vim'
brew 'git'
brew 'git-lfs'
brew 'base64'
brew 'rsync'
brew 'gzip'
brew 'unzip'
brew 'grep'
brew 'gpg'
brew 'curl'
brew 'wget'
brew 'openssl'
brew 'netcat'

### Compilers, Languages, and Frameworks
brew 'gcc'
brew 'llvm'
brew 'python'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'node'

# GUIs, IDEs, and such
cask 'docker'
cask 'visual-studio-code'
cask 'postman'
cask 'google-cloud-sdk'
